app/mailers/product_mailer.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def notify_product_creation(product_id)
        @product = Product.find(product_id)