app/controllers/products_controller.rb

SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 11]]
---
  def index
    # @product= policy_scope(Product).all
    @products = if params[:q] && !params[:q].blank?
                  Product.matching(params[:q]).page(params[:page])