app/controllers/products_controller.rb

        def index
            # @product= policy_scope(Product).all
            @products= if params[:q] && !params[:q].blank?
                Product.matching(params[:q])
            else
                Product.all.paginate(page: params[:page], per_page: 2)
---
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

        def create
            @product =Product.new(product_params)
            authorize @product
            if @product.save
---
INSERT INTO "products" ("name", "code", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "wcw"], ["code", "eqdqd"], ["price", 3332.0], ["description", "sdcwc"], ["created_at", "2023-06-20 13:03:50.403631"], ["updated_at", "2023-06-20 13:03:50.403631"]]

        def update

            if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Ironman"], ["updated_at", "2023-06-16 11:17:33.779705"], ["id", 12]]

        def destroy
            authorize @product
            @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 20]]

        def load_product
            @product =Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]