app/controllers/reviews_controller.rb

        def create
            @product = Product.find(params[:product_id])
           # @reviews = @user.reviews.create(review_params)
           #@user = User.find_by(id: current_user )
          # @user = User.find(user_id)

            @review = @product.reviews.create(review_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_name", "rating", "created_at", "updated_at", "product_id", "comments") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "shre"], ["rating", 3.0], ["created_at", "2023-06-23 06:09:03.095386"], ["updated_at", "2023-06-23 06:09:03.095386"], ["product_id", 7], ["comments", "avg"]]

        def destroy
          @product = Product.find(params[:product_id])

          @review = @product.reviews.find(params[:id])
          authorize @review
          @review.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ? AND "reviews"."id" = ? LIMIT ?  [["product_id", 8], ["id", 13], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 13]]

        def set_product
          @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]