app/views/products/_review.html.slim

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 8]]
---
  | Review
  -@product.reviews.each do |review|